IDENTIFICATION DIVISION.
  PROGRAM-ID.
    UGLYFACE.

ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
        SELECT SYSIN ASSIGN TO KEYBOARD
          ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
  FILE SECTION.
    FD SYSIN.
    01 SECOND-LINE PIC X(255).

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
    READ SYSIN
    CLOSE SYSIN
  DISPLAY "Hello, World.".
  DISPLAY SECOND-LINE.

STOP RUN.
